Repository: marcomg/simple-file-sharing
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: it_it

source: Error: you do not have permission to access this page
it_it: Errore: non hai i permessi per accedere a questa pagina

source: Login!
it_it: Effettua il login!

source: Check for updates
it_it: Controllo update

source: It is impossible to check for updates
it_it: Impossibile controllare gli aggiornamenti

source: Admin control panel
it_it: Pannello di controllo amministratore

source: Error, the link that you entered does not contain the file ID!
it_it: Errore, il link che hai digitato non contiene l'ID del file!

source: Error, the file you are trying to download does not exist.
it_it: Errore, il file che stai cercando di scaricare non esiste.

source: Error, this file can be downloaded only by the owner. You are not authorized to download it.
it_it: Errore, questo file può essere scaricato solamente del proprietario. Non sei autorizzato a scaricarlo.

source: Fatal error: The database is not healthy!
it_it: Errore fatale: il database non è integro!

source: Fails, the password set by the person who provided the file download is not installed or is wrong. <br/>You are not authorized to download!
it_it: Errore, la password fissata da chi ha previsto il download del file non è stata inserita o è sbagliata.<br/> Non sei autorizzato a scaricare!

source: Error: file cookie isn't isset and you aren't allowed to download required file
it_it: Errore: il cookie del file non è settato e non ti è permesso scaricare il file

source: Download
it_it: Scarica

source: Error 404
it_it: Errore 404

source: Error, the file that you tried was not found.
it_it: Errore, il file che hai cercato non è stato trovato.

source: File overview
it_it: Panoramica file

source: Home Page
it_it: Pagina principale

source: Error: username or password is incorrect
it_it: Errore: username o password errati

source: Login wrong
it_it: Login errato

source: Login successful
it_it: Login successo

source: Login
it_it: Entra

source: Logout
it_it: Esci

source: Error, registration has been disabled.
it_it: Errore, la registrazione è stata disabilitata.

source: Register
it_it: Registrati

source: There was an error:<br/><ul><li>check that you have entered all the fields;</li><li>Could it be that the username you specified has already been used by someone else, try a different one!</li></ul>
it_it: Si è verificato un errore:<br/><ul><li>controlla di aver inserito tutti i campi;</li><li>potrebbe darsi che l\'username da te specificato sia già stato utilizzato da qualcun\'altro, prova con uno differente!</li></ul><br/>

source: Registration is not carried out
it_it: Registrazione non effettuata

source: Registered successfully
it_it: Registrazione effettuata con successo

source: User control panel
it_it: Pannello di controllo utente

source: Upload
it_it: Carica

source: There was an error while uploading the file.
it_it: Si è verificato un errore durante il caricamento del file.

source: Error, the file is too big!
it_it: Errore, il file è troppo grande!

source: Error, you have exceeded the maximum number of files. Delete something!
it_it: Errore, hai superato il limite massimo di quantità di file. Cancella qualcosa!

source: Welcome admin!
it_it: Benvenuto admin!

source: Welcome admin in the admin control panel, here you can perform tasks from admin!
it_it: Benvenuto admin nel pannello di controllo amministratore, qui puoi eseguire delle operazioni da amministratore!

source: There are updates available, the latest available version is %1, click
it_it: Ci sono aggiornamenti disponibili, l'ultima versione disponibile è la %1, clicca

source: here
it_it: qui

source: You have the latest version available
it_it: Hai l'ultima versione disponibile

source: File name
it_it: Nome file

source: File size
it_it: Dimensione file

source: Required password
it_it: Password richiesta

source: Yes
it_it: Si

source: Insert password
it_it: Inserisci password

source: 404 Error!
it_it: Errore 404!

source: Reality is appearance, mistakes are always in wait.<br/>This page doesn't exist, now, one day it might.<br/>Come back to a safer harbour:
it_it: La realtà è apparenza, l'errore è sempre in agguato.<br/>Questa pagina ora non esiste, ma un giorno forse, chissà.<br/>Torna ad un porto sicuro:

source: File type
it_it: Tipo file

source: File password
it_it: Password file

source: File visibility
it_it: Visibilità file

source: Operations on the file
it_it: Modifica file

source: Edit
it_it: Modifica

source: Change visibility
it_it: Cambia visibilità

source: Caution! This operation is irreversible. The file %1 will be removed from the system. Continue?
it_it: Attenzione! Questa operazione sarà irreversibile. Il file $1 verrà eliminato dal sistema. Continuare?

source: Delete
it_it: Cancella

source: There aren't your files in our database. To see them you should upload!
it_it: Non c'è nessun file di tua proprietà nel nostro database. Per vederne uno devi caricarlo.

source: File ID
it_it: ID file

source: There is no password
it_it: Non è stata settata alcuna password

source: Remember that if the file is set to private anyone outside of you can download it. To restrict access you can set a password.
it_it: Ricorda che se il file è impostato come privato nessuno, al di fuori di te potrà scaricarlo. Per limitarne l'accesso puoi impostare una password.

source: File edit
it_it: Modifica file

source: Change password
it_it: Cambia password

source: Mark the file as private
it_it: Rendi il file privato

source: Mark the file as public
it_it: Rendi il file pubblico

source: Dangerous zone!
it_it: Zona pericolosa!

source: Caution! This operation is irreversible. The file %1 will no longer have the same identification code and then all the links associated with it will lead to an error and must be upgraded. Continue?
it_it: Attenzione! Questa operazione sarà irreversibile. Il file %1 non avrà più lo stesso codice identificativo e quindi tutti i link ad esso associati porteranno ad un errore e dovranno essere aggiornati. Continuare?

source: Change file ID
it_it: Cambia l'ID del file

source: Caution! This operation is irreversible. The file %1 is removed from the system. Continue?
it_it: Attenzione! Questa operazione sarà irreversibile. Il file %1 verrà eliminato dal sistema. Continuare?

source: Delete file
it_it: Cancella file

source: Public
it_it: Pubblico

source: Private
it_it: Privato

source: File (max size: %1)
it_it: File (dimensione massima: %1)

source: User
it_it: Utente

source: simple-file-sharing is a simple program written in PHP for file sharing and hosting.
it_it: simple-file-sharing è un semplice programma scritto in php per la condivisione e l'archiviazione di file.

source: The program is released under the GPLv3 license, if you are interested to view its code can click on the link in the footer of the page that takes you to the page of googlecode. Here, you can clone the git repository.
it_it: Il programma è rilasciato sotto licenza gplv3, se sei interessato a visionarne il codice puoi cliccare sul link nel footer della pagina che ti porta alla pagina di googlecode. Lì potrai clonare il repository git.

source: To upload a file you must sign up :-)
it_it: Per caricare un file devi registrarti :-)

source: Please sign in
it_it: Per favore Entra

source: Username
it_it: Nome utente

source: Send
it_it: Invia

source: Please sign up
it_it: Per favore Registrati

source: Login successful :-)
it_it: Sei entrato con successo

source: You will be redirected to the home page short ;-)
it_it: Sarai reindirizzato a breve alla pagina principale ;-)

source: Registration completed successfully!
it_it: Registrazione completata con successo

source: Here is the summary of your data. We suggest that you print this page.
it_it: Ecco il riassunto dei tuoi dati. Ti consigliamo di stampare questa pagina.

source: Hallo %1!
it_it: Ciao %1!

source: Hallo <b>%1</b>,<br/>welcome to the user control panel! Here you can real all regards you and you can edit it.
it_it: Ciao <b>%1</b>,<br/>benvenuto nel pannello di controllo utente! Qui puoi leggere tutto ciò che riguarda te e puoi modificarlo.

source: The only one thing you can't edit is your username.
it_it: L'unica cosa che non puoi modificare è il tuo nome utente.

source: Status report
it_it: Resoconto sullo stato

source: Total space of files
it_it: Totale spazio occupato dai file

source: of a total of
it_it: su un totale di

source: User changes
it_it: Modifiche utente

source: Are you sure you want to delete your account and all files associated with it? Caution! This operation is irreversible!
it_it: Sei sicuro di voler cancellare completamente il tuo account e tutti i file ad esso associati? Attenzione! Questa operazione è irreversibile!

source: Delete your account
it_it: Cancella il tuo account

source: File succesfull uploaded
it_it: File caricato con successo

source: File details
it_it: Dettagli file

source: Password for download
it_it: Password per il download

source: Visibility file
it_it: Visibilità file

source: Link download file
it_it: Link scaricamento file
